particleMigration/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1e-6;

vertices
(
    (0 0 0)
    (785 0 0)
    (785 785 0)
    (0 785 0)
    (0 0 785)
    (785 0 785)
    (785 785 785)
    (0 785 785)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (2 6 5 1)
        );
    }
    right
    {
        type cyclic;
        neighbourPatch left;
        faces
        (
            (3 7 6 2)
        );
    }
    left
    {
        type cyclic;
        neighbourPatch right;
        faces
        (
            (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
