particleMigration/constant/kinematicCloudPositions
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    location    "constant";
    object      kinematicCloudPositions;
}

1000
(
(3.34708869962e-05 3.53661930101e-05 4.55526608682e-05)
(0.000121485717747 3.6942066925e-05 3.57064912011e-05)
(0.000198333654032 3.26103310639e-05 4.29115643529e-05)
(0.000284114011729 3.39140679216e-05 4.87640360131e-05)
(0.000356794597818 3.06850567449e-05 3.80172917244e-05)
(0.00043994144189 4.343502693e-05 3.5572092354e-05)
(0.000515208107422 3.33182603828e-05 3.03818969014e-05)
(0.000581541487265 3.58609234201e-05 3.85122688927e-05)
(0.000662299293695 4.59428808706e-05 3.2749374581e-05)
(0.00073789659707 3.0595334409e-05 4.13391490496e-05)
(4.67687546632e-05 0.000119903862218 4.84059933143e-05)
(0.000122514240948 0.000125391885172 4.83498147044e-05)
(0.000197228912463 0.000127026478361 3.914376939e-05)
(0.000269955122603 0.000116727949705 4.27479999815e-05)
(0.000349665733271 0.000126301207674 3.4101187145e-05)
(0.000428355161616 0.000112638897784 3.61861881424e-05)
(0.000499758948363 0.000120475773312 3.46376014839e-05)
(0.000579595618579 0.000120226190173 3.23897363584e-05)
(0.000663104011867 0.000116497095957 3.18360386188e-05)
(0.000739771502253 0.000117205990379 3.87491378834e-05)
(3.40621497392e-05 0.000191959395858 3.45673276045e-05)
(0.000112675476409 0.000195884631959 3.31453956755e-05)
(0.000196157390496 0.000190872008801 4.6424139819e-05)
(0.000267970367857 0.000203925902599 3.24315567335e-05)
(0.00035856001158 0.000198605196959 3.30855409653e-05)
(0.000437257995966 0.000190935577771 3.04661928595e-05)
(0.00051275221223 0.000197033543776 4.21012936442e-05)
(0.000581848359234 0.000190912346363 4.31673231594e-05)
(0.000658366574542 0.000204199684968 3.77386774167e-05)
(0.000748259364971 0.000192288771161 3.24456177179e-05)
(2.88583485486e-05 0.000268604360504 4.70921643866e-05)
(0.000127771627662 0.000273516288714 3.66800955425e-05)
(0.000191501198387 0.000284629076595 2.98861042186e-05)
(0.000272815614986 0.00026772658836 3.37423533178e-05)
(0.000359184766515 0.000268471354201 4.03532199862e-05)
(0.000428930940841 0.000274904336085 3.5719714101e-05)
(0.000505644785883 0.000270125893236 3.04621564865e-05)
(0.000588364540434 0.000282874952649 4.87289925006e-05)
(0.000657232897986 0.000283604258822 3.12282124024e-05)
(0.000751003133269 0.000283154257128 3.22117721097e-05)
(3.56778629324e-05 0.00035066752968 3.60039636579e-05)
(0.000118094539585 0.00034284312841 3.7611164544e-05)
(0.000204254455577 0.000344505052215 3.8912677706e-05)
(0.000274352121681 0.000359239102737 4.90963401951e-05)
(0.00035763940908 0.0003484543498 4.28555514035e-05)
(0.000428518500144 0.000358932969485 4.29754751675e-05)
(0.000520371291334 0.00036102241399 2.96297593704e-05)
(0.000584305911099 0.000360930879316 4.13874698425e-05)
(0.00066394904743 0.000343830996615 4.48215862403e-05)
(0.000735184690706 0.000344620318814 4.97098206671e-05)
(4.51000971719e-05 0.00043955550094 3.87658691424e-05)
(0.000110731246934 0.000432470149322 3.76780066293e-05)
(0.0001891079123 0.000424668275122 3.41239928177e-05)
(0.000284141325823 0.000442067873132 4.3566709663e-05)
(0.000357979821376 0.000436677791024 3.96186980149e-05)
(0.000424913050603 0.000439754211356 4.73123735901e-05)
(0.000514691084846 0.000440936523568 4.94235610097e-05)
(0.000588823669202 0.0004372091857 4.17217296043e-05)
(0.000659087573801 0.000427849875836 3.00881199581e-05)
(0.00075394973462 0.000421620282104 4.00402916787e-05)
(3.24169885971e-05 0.000502768057104 3.2167573755e-05)
(0.000125739539583 0.000510132794312 3.58778859986e-05)
(0.00020683075226 0.000511224437915 3.50816032072e-05)
(0.000272008462799 0.00051440139848 3.12011260223e-05)
(0.000358722998083 0.000518383954427 3.87229046135e-05)
(0.000430421173222 0.000502685817619 3.7612522167e-05)
(0.000515854205862 0.000508426875862 4.17919368803e-05)
(0.000579080406104 0.000504309579297 3.29726495999e-05)
(0.000677448472395 0.000500596734747 3.32161755354e-05)
(0.000735818006764 0.00051320744966 4.249644709e-05)
(3.59758282244e-05 0.000578923034152 3.78725463666e-05)
(0.000110783810393 0.000587196920172 3.65542133043e-05)
(0.000190338424902 0.000595991079829 4.33324759753e-05)
(0.000274127824868 0.000586623830211 3.09636003963e-05)
(0.000355433902104 0.00058883800056 4.78420516923e-05)
(0.000441688545728 0.000595311872194 4.70221272787e-05)
(0.00051016076325 0.000586074813857 3.88046971568e-05)
(0.000589412186382 0.00059548358356 3.18530798269e-05)
(0.000669381345779 0.00059735495345 3.33676248694e-05)
(0.000741253761673 0.000596003238451 4.24688400068e-05)
(4.9115529454e-05 0.000670261464771 4.87736106578e-05)
(0.000124677551525 0.000670952087941 3.26792903316e-05)
(0.00019017833589 0.000674944414744 3.57300177441e-05)
(0.000278701506411 0.000665880288361 3.83883969602e-05)
(0.000342876637973 0.000674081624218 3.5253671394e-05)
(0.00042829804349 0.000658170102297 4.18914708864e-05)
(0.000516155184529 0.000667484019554 3.87775609719e-05)
(0.000594517310528 0.000658702544127 4.01172641716e-05)
(0.000672525089115 0.000664416391883 4.72220854457e-05)
(0.000744834697689 0.000659108924078 4.93576902029e-05)
(3.83153160336e-05 0.000751107865581 3.03110766971e-05)
(0.000124295873205 0.000738374146865 3.13009484615e-05)
(0.000191511567431 0.000744154173164 3.89381299513e-05)
(0.000273230160122 0.000735884565268 4.1306577564e-05)
(0.000358378326824 0.000755897188482 4.03979201005e-05)
(0.000440903452261 0.000755329421676 3.31542194022e-05)
(0.000501059422377 0.000738748483912 4.44307663767e-05)
(0.000583683740119 0.000737531390786 4.86475992241e-05)
...
)
